--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/projects/csac_survey2024/temp2025/log/explore/explore_sample_char.txt
  log type:  text
 opened on:  20 Jul 2025, 09:55:11

. 
. graph drop _all

. set more off

. set varabbrev off

. set graphics off

. set scheme s1color

. set seed 1984

. 
. use $projdir/dta/csac_2025_initial_clean, clear

. 
. //------------------------------------------------
. // HS Senior status and college going
. //------------------------------------------------
. 
. tab hs_senior 

        Q8: |
  Graduated |
      HS in |
  spring or |
summer 2025 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         56        0.80        0.80
          1 |      6,924       99.20      100.00
------------+-----------------------------------
      Total |      6,980      100.00

. 
. tab attend_coll if hs_senior == 1

Q27: plan to |
      attend |
  college in |
    the fall |      Freq.     Percent        Cum.
-------------+-----------------------------------
I don't know |        222        3.67        3.67
          No |        127        2.10        5.78
         Yes |      5,694       94.22      100.00
-------------+-----------------------------------
       Total |      6,043      100.00

. 
. 
. 
. //------------------------------------------------
. // demographics
. //------------------------------------------------
. 
. di "race for all respondents"
race for all respondents

. tab race_simple_23

        mutually |
 exclusive race, |
    2023 version |      Freq.     Percent        Cum.
-----------------+-----------------------------------
           Black |        210        3.91        3.91
          Native |         18        0.34        4.25
           Asian |        568       10.58       14.83
        Filipino |         73        1.36       16.19
        Hispanic |      2,728       50.82       67.01
Pacific Islander |          8        0.15       67.16
           White |        782       14.57       81.73
      Other Race |        130        2.42       84.15
     Multiracial |        851       15.85      100.00
-----------------+-----------------------------------
           Total |      5,368      100.00

. tab race_simple_24

   race narrowly |
         defined |
       (mutually |
exclusive), 2024 |
         version |      Freq.     Percent        Cum.
-----------------+-----------------------------------
           Black |        216        4.02        4.02
          Native |         18        0.34        4.36
           Asian |        582       10.84       15.20
        Filipino |         73        1.36       16.56
        Hispanic |      2,761       51.43       68.00
Pacific Islander |          8        0.15       68.14
           White |        816       15.20       83.35
      Other Race |        130        2.42       85.77
     Multiracial |        764       14.23      100.00
-----------------+-----------------------------------
           Total |      5,368      100.00

. tab race_hrchy

 mutually exclusive race based |
              on URM hierarchy |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
American Indian/Alaskan Native |        112        2.09        2.09
                         Black |        360        6.71        8.79
                      Hispanic |      3,084       57.45       66.24
              Pacific Islander |         29        0.54       66.78
                      Filipino |        168        3.13       69.91
                         Asian |        669       12.46       82.38
                    Other race |        164        3.06       85.43
            White/Non-Hispanic |        782       14.57      100.00
-------------------------------+-----------------------------------
                         Total |      5,368      100.00

. 
. di "race for high school seniors"
race for high school seniors

. tab race_simple_23 if hs_senior==1 

        mutually |
 exclusive race, |
    2023 version |      Freq.     Percent        Cum.
-----------------+-----------------------------------
           Black |        210        3.91        3.91
          Native |         18        0.34        4.25
           Asian |        568       10.58       14.83
        Filipino |         73        1.36       16.19
        Hispanic |      2,728       50.82       67.01
Pacific Islander |          8        0.15       67.16
           White |        782       14.57       81.73
      Other Race |        130        2.42       84.15
     Multiracial |        851       15.85      100.00
-----------------+-----------------------------------
           Total |      5,368      100.00

. tab race_simple_23 if hs_senior==1 

        mutually |
 exclusive race, |
    2023 version |      Freq.     Percent        Cum.
-----------------+-----------------------------------
           Black |        210        3.91        3.91
          Native |         18        0.34        4.25
           Asian |        568       10.58       14.83
        Filipino |         73        1.36       16.19
        Hispanic |      2,728       50.82       67.01
Pacific Islander |          8        0.15       67.16
           White |        782       14.57       81.73
      Other Race |        130        2.42       84.15
     Multiracial |        851       15.85      100.00
-----------------+-----------------------------------
           Total |      5,368      100.00

. tab race_hrchy if hs_senior == 1

 mutually exclusive race based |
              on URM hierarchy |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
American Indian/Alaskan Native |        112        2.09        2.09
                         Black |        360        6.71        8.79
                      Hispanic |      3,084       57.45       66.24
              Pacific Islander |         29        0.54       66.78
                      Filipino |        168        3.13       69.91
                         Asian |        669       12.46       82.38
                    Other race |        164        3.06       85.43
            White/Non-Hispanic |        782       14.57      100.00
-------------------------------+-----------------------------------
                         Total |      5,368      100.00

. 
. 
. di "parent education"
parent education

. 
. tab parent_edu if hs_senior==1

  Q72: highest parent education |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
                     Don't know |      1,082       20.12       20.12
   Did not complete high school |      1,488       27.67       47.80
            High school diploma |        607       11.29       59.08
Some college, no college degree |        315        5.86       64.94
               Associate degree |        757       14.08       79.02
              Bachelor's degree |        756       14.06       93.08
   Graduate/Professional degree |        372        6.92      100.00
--------------------------------+-----------------------------------
                          Total |      5,377      100.00

. 
. 
. di "First-gen status, defined by college degree"
First-gen status, defined by college degree

. tab firstgen_bydegree if hs_senior==1

firstgen_byd |
       egree |      Freq.     Percent        Cum.
-------------+-----------------------------------
Not firstgen |      1,885       35.06       35.06
    Firstgen |      3,492       64.94      100.00
-------------+-----------------------------------
       Total |      5,377      100.00

. 
. 
. di "First-gen status, defined by attending college"
First-gen status, defined by attending college

. tab firstgen_byattend if hs_senior==1

firstgen_bya |
       ttend |      Freq.     Percent        Cum.
-------------+-----------------------------------
Not firstgen |      2,200       40.92       40.92
    Firstgen |      3,177       59.08      100.00
-------------+-----------------------------------
       Total |      5,377      100.00

. 
. 
. di "home language is english"
home language is english

. 
. tab home_lang_eng if hs_senior == 1

    Primary |
       home |
   language |
    English |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      2,451       45.57       45.57
        Yes |      2,927       54.43      100.00
------------+-----------------------------------
      Total |      5,378      100.00

. 
. di "has a job"
has a job

. 
. tab has_job if hs_senior == 1

       Q77: |
  currently |
  has a job |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      4,190       77.77       77.77
        Yes |      1,198       22.23      100.00
------------+-----------------------------------
      Total |      5,388      100.00

. 
. di "gender"
gender

. 
. tab gender if hs_senior == 1

              Q80 |      Freq.     Percent        Cum.
------------------+-----------------------------------
            Woman |      3,221       59.99       59.99
              Man |      1,876       34.94       94.93
       Non-binary |        110        2.05       96.98
Prefer not to say |        127        2.37       99.35
            Other |         35        0.65      100.00
------------------+-----------------------------------
            Total |      5,369      100.00

. 
. 
. 
. log close 
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/projects/csac_survey2024/temp2025/log/explore/explore_sample_char.txt
  log type:  text
 closed on:  20 Jul 2025, 09:55:11
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
