--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/projects/csac_survey2024/temp2025/log/explore/explore_sample_char.txt
  log type:  text
 opened on:  12 Aug 2025, 16:56:32

. 
. graph drop _all

. set more off

. set varabbrev off

. set graphics off

. set scheme s1color

. set seed 1984

. 
. use $projdir/dta/csac_2025_initial_clean, clear

. 
. //------------------------------------------------
. // HS Senior status and college going
. //------------------------------------------------
. 
. tab hs_senior 

        Q8: |
  Graduated |
      HS in |
  spring or |
summer 2025 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         56        0.80        0.80
          1 |      6,924       99.20      100.00
------------+-----------------------------------
      Total |      6,980      100.00

. 
. tab attend_coll if hs_senior == 1

Q27: plan to |
      attend |
  college in |
    the fall |      Freq.     Percent        Cum.
-------------+-----------------------------------
I don't know |        222        3.67        3.67
          No |        127        2.10        5.78
         Yes |      5,694       94.22      100.00
-------------+-----------------------------------
       Total |      6,043      100.00

. 
. 
. 
. //------------------------------------------------
. // demographics
. //------------------------------------------------
. 
. di "race for all respondents"
race for all respondents

. tab race_simple_23

        mutually |
 exclusive race, |
    2023 version |      Freq.     Percent        Cum.
-----------------+-----------------------------------
           Black |        210        3.91        3.91
          Native |         18        0.34        4.25
           Asian |        568       10.58       14.83
        Filipino |         73        1.36       16.19
        Hispanic |      2,728       50.82       67.01
Pacific Islander |          8        0.15       67.16
           White |        782       14.57       81.73
      Other Race |        130        2.42       84.15
     Multiracial |        851       15.85      100.00
-----------------+-----------------------------------
           Total |      5,368      100.00

. tab race_simple_24

   race narrowly |
         defined |
       (mutually |
exclusive), 2024 |
         version |      Freq.     Percent        Cum.
-----------------+-----------------------------------
           Black |        216        4.02        4.02
          Native |         18        0.34        4.36
           Asian |        582       10.84       15.20
        Filipino |         73        1.36       16.56
        Hispanic |      2,761       51.43       68.00
Pacific Islander |          8        0.15       68.14
           White |        816       15.20       83.35
      Other Race |        130        2.42       85.77
     Multiracial |        764       14.23      100.00
-----------------+-----------------------------------
           Total |      5,368      100.00

. tab race_hrchy

 mutually exclusive race based |
              on URM hierarchy |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
American Indian/Alaskan Native |        112        2.09        2.09
                         Black |        366        6.82        8.90
                      Hispanic |      3,116       58.05       66.95
              Pacific Islander |         29        0.54       67.49
                      Filipino |        168        3.13       70.62
                         Asian |        673       12.54       83.16
                    Other race |        121        2.25       85.41
            White/Non-Hispanic |        783       14.59      100.00
-------------------------------+-----------------------------------
                         Total |      5,368      100.00

. 
. di "race for high school seniors"
race for high school seniors

. tab race_simple_23 if hs_senior==1 

        mutually |
 exclusive race, |
    2023 version |      Freq.     Percent        Cum.
-----------------+-----------------------------------
           Black |        210        3.91        3.91
          Native |         18        0.34        4.25
           Asian |        568       10.58       14.83
        Filipino |         73        1.36       16.19
        Hispanic |      2,728       50.82       67.01
Pacific Islander |          8        0.15       67.16
           White |        782       14.57       81.73
      Other Race |        130        2.42       84.15
     Multiracial |        851       15.85      100.00
-----------------+-----------------------------------
           Total |      5,368      100.00

. tab race_simple_23 if hs_senior==1 

        mutually |
 exclusive race, |
    2023 version |      Freq.     Percent        Cum.
-----------------+-----------------------------------
           Black |        210        3.91        3.91
          Native |         18        0.34        4.25
           Asian |        568       10.58       14.83
        Filipino |         73        1.36       16.19
        Hispanic |      2,728       50.82       67.01
Pacific Islander |          8        0.15       67.16
           White |        782       14.57       81.73
      Other Race |        130        2.42       84.15
     Multiracial |        851       15.85      100.00
-----------------+-----------------------------------
           Total |      5,368      100.00

. tab race_hrchy if hs_senior == 1

 mutually exclusive race based |
              on URM hierarchy |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
American Indian/Alaskan Native |        112        2.09        2.09
                         Black |        366        6.82        8.90
                      Hispanic |      3,116       58.05       66.95
              Pacific Islander |         29        0.54       67.49
                      Filipino |        168        3.13       70.62
                         Asian |        673       12.54       83.16
                    Other race |        121        2.25       85.41
            White/Non-Hispanic |        783       14.59      100.00
-------------------------------+-----------------------------------
                         Total |      5,368      100.00

. 
. 
. di "parent education"
parent education

. 
. tab parent_edu if hs_senior==1

  Q72: highest parent education |      Freq.     Percent        Cum.
--------------------------------+-----------------------------------
   Did not complete high school |      1,082       20.12       20.12
            High school diploma |      1,488       27.67       47.80
Some college, no college degree |        607       11.29       59.08
               Associate degree |        315        5.86       64.94
              Bachelor's degree |        757       14.08       79.02
   Graduate/Professional degree |        756       14.06       93.08
                     Don't know |        372        6.92      100.00
--------------------------------+-----------------------------------
                          Total |      5,377      100.00

. 
. 
. di "First-gen status, defined by college degree"
First-gen status, defined by college degree

. tab firstgen_bydegree if hs_senior==1

firstgen_byd |
       egree |      Freq.     Percent        Cum.
-------------+-----------------------------------
Not firstgen |      1,828       36.52       36.52
    Firstgen |      3,177       63.48      100.00
-------------+-----------------------------------
       Total |      5,005      100.00

. 
. 
. di "First-gen status, defined by attending college"
First-gen status, defined by attending college

. tab firstgen_byattend if hs_senior==1

firstgen_bya |
       ttend |      Freq.     Percent        Cum.
-------------+-----------------------------------
Not firstgen |      2,435       48.65       48.65
    Firstgen |      2,570       51.35      100.00
-------------+-----------------------------------
       Total |      5,005      100.00

. 
. 
. di "home language is english"
home language is english

. 
. tab home_lang_eng if hs_senior == 1

    Primary |
       home |
   language |
    English |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      2,451       45.57       45.57
        Yes |      2,927       54.43      100.00
------------+-----------------------------------
      Total |      5,378      100.00

. 
. di "has a job"
has a job

. 
. tab has_job if hs_senior == 1

       Q77: |
  currently |
  has a job |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      4,190       77.77       77.77
        Yes |      1,198       22.23      100.00
------------+-----------------------------------
      Total |      5,388      100.00

. 
. di "gender"
gender

. 
. tab gender if hs_senior == 1

              Q80 |      Freq.     Percent        Cum.
------------------+-----------------------------------
            Woman |      3,221       59.99       59.99
              Man |      1,876       34.94       94.93
       Non-binary |        110        2.05       96.98
Prefer not to say |        127        2.37       99.35
            Other |         35        0.65      100.00
------------------+-----------------------------------
            Total |      5,369      100.00

. 
. /* jake add for locale */
. 
. di "locale"
locale

. 
. tab schoollocale if hs_senior == 1,m

          LOCALE |      Freq.     Percent        Cum.
-----------------+-----------------------------------
      City Large |      1,342       19.38       19.38
    City Midsize |        522        7.54       26.92
      City Small |        348        5.03       31.95
  Suburban Large |      1,933       27.92       59.86
Suburban Midsize |        184        2.66       62.52
  Suburban Small |        134        1.94       64.46
     Town Fringe |        168        2.43       66.88
    Town Distant |        148        2.14       69.02
     Town Remote |         45        0.65       69.67
    Rural Fringe |        256        3.70       73.37
   Rural Distant |         52        0.75       74.12
    Rural Remote |         13        0.19       74.31
               . |      1,779       25.69      100.00
-----------------+-----------------------------------
           Total |      6,924      100.00

. 
. di "region"
region

. 
. tab schoolregion if hs_senior == 1,m

        schoolregion |      Freq.     Percent        Cum.
---------------------+-----------------------------------
            Superior |        516        7.45        7.45
         North Coast |        105        1.52        8.97
         SF Bay Area |        622        8.98       17.95
N San Joaquin Valley |        173        2.50       20.45
       Central Coast |        347        5.01       25.46
S San Joaquin Valley |        523        7.55       33.02
       Inland Empire |        674        9.73       42.75
           LA County |      1,292       18.66       61.41
       Orange County |        373        5.39       66.80
       SD - Imperial |        396        5.72       72.52
                   . |      1,903       27.48      100.00
---------------------+-----------------------------------
               Total |      6,924      100.00

. 
. /*end jake add */
. 
. 
. log close 
      name:  <unnamed>
       log:  /home/research/ca_ed_lab/projects/csac_survey2024/temp2025/log/explore/explore_sample_char.txt
  log type:  text
 closed on:  12 Aug 2025, 16:56:32
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
